Revit 2024 API
BuiltInFailures.LooseDimensionFailures.LooseDimensionsForCurtainWall Property
 Switching wall type to Family Curtain Wall. All Dimension References to the side faces of the Wall will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LooseDimensionsForCurtainWall { get; }
Visual Basic
Public Shared ReadOnly Property LooseDimensionsForCurtainWall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LooseDimensionsForCurtainWall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LooseDimensionFailures Class
Autodesk.Revit.DB Namespace